{
	"cryptonews": [
		{
			"id": 1,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "Bill Gates says cryptocurrency is one innovation the world could do without",
			"description": "Bill Gates, the Microsoft co-founder and technological whiz turned philanthropist, may not be a fan of bitcoin and digital-assets.",
			"coverImage": "https://images.mktw.net/im-300849?width=1260&size=1.5005861664712778",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "Bill Gates, the Microsoft co-founder and technological whiz turned philanthropist, may not be a fan of bitcoin and digital-assets. Asked during an interview published on Thursday with The Wall Street Journal what technological advancement the world could do without, Gates had this to say “The way cryptocurrency works today allows for certain criminal activities. It’d be good to get rid of that,” he quickly added: “I probably should have said bio weapons. That’s a really bad thing.”"
		},
		{
			"id": 2,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "Blockchain.com raised $ 120 million in investments",
			"description": "Cryptocurrency wallet provider Blockchain.com has raised $ 120 million in funding from macro investors including Moore Strategic Ventures, Google Ventures, Lightspeed Venture Partners and others.",
			"coverImage": "https://techcrunch.com/wp-content/uploads/2021/02/andre-francois-mckenzie-JrjhtBJ-pGU-unsplash.jpg?w=1390&crop=1",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "Blockchain.com has announced that it has raised a $120 million funding round. The company develops a popular cryptocurrency wallet as well as an exchange, an explorer and more. Moore Strategic Ventures, Kyle Bass, Access Industries, Rovida Advisors, Lightspeed Venture Partners, GV, Lakestar, Eldridge and other unnamed investors participated in today’s funding round. Overall, the company has raised more than $190 million since its creation Originally named Blockchain.info, the company started off as a blockchain explorer. An explorer lets you enter the hash of any transaction that occurs on the bitcoin blockchain to get more information about the amount, fees, number of confirmations as well as the wallet addresses of the sender and the receiver. Over time, explorers started adding support for more blockchains and more types of data Blockchain.com then built an open-source bitcoin wallet — it now supports more cryptocurrencies and stablecoins. The company’s wallet is a noncustodial wallet, which means that you’re in control of your private keys. Other noncustodial wallets include Coinbase Wallet, Argent, ZenGo, etc."
		},
		{
			"id": 3,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "Bitcoin Climbs Above $52,000 as Musk Backs Crypto Over Cash",
			"description": "Billionaire Elon Musk defended Tesla Inc.’s $1.5 billion Bitcoin funding on Twitter, calling the cryptocurrency a “less dumb” model of cash.",
			"coverImage": "//images.hindustantimes.com/tech/img/2021/02/19/600x338/2021-02-19T114549Z_1507401579_RC2NVL9QZHQ0_RTRMADP_3_CRYPTO-CURRENCY-BITCOIN_1613742609659_1613742643577.JPG",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "Billionaire Elon Musk defended Tesla Inc.’s $1.5 billion Bitcoin funding on Twitter, calling the cryptocurrency a “less dumb” model of cash. “When fiat currency has negative real interest, only a fool wouldn’t look elsewhere,” Musk stated in a reference to the sub-zero returns on cash attributable to negative-yielding debt. The feedback pushed Bitcoin to a document on Friday, with costs climbing above $52000 In a way, Musk’s feedback sum up one of many massive points dealing with markets this year. With a lot cash being pumped into the monetary system from governments combating the pandemic, buyers are more and more apprehensive about inflation and in search of different locations to place their money “Having some Bitcoin, which is simply a less dumb form of liquidity than cash, is adventurous enough for an S&P 500 company,” Musk wrote, including that Tesla’s resolution to purchase Bitcoin doesn’t immediately mirror his opinion “Bitcoin is almost as bs as fiat money. The keyword is ‘almost,’” he added Bitcoin was up 1.2% on the day at $52669 as of 11: 10 a.m. in London. Just this week, costs have jumped about 10%."
		}
	],
	"technews": [
		{
			"id": 1,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "Margaret Mitchell: Google fires AI ethics founder",
			"description": "Google has fired the founder and co-head of its artificial intelligence ethics unit, claiming she violated the company's code of conduct.",
			"coverImage": "https://ichef.bbci.co.uk/news/976/cpsprodpb/18299/production/_115796989_gettyimages-1028811892.jpg",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "Google has fired the founder and co-head of its artificial intelligence ethics unit, claiming she violated the company's code of conduct. In a statement, Google said an investigation found Margaret Mitchell had moved files outside the company. The ethics unit has been under scrutiny since December, following the departure of another senior figure, Timnit Gebru. Both women had campaigned for more diversity at Google and raised concerns about censorship within the company. Dr Mitchell announced the news in a tweet, which read 'I'm fired'. For the past five weeks she had been locked out of Google's systems, including her emails and calendars."
		},
		{
			"id": 2,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "Nvidia limits crypto-mining on new graphics card",
			"description": "Graphics card-maker Nvidia says it will deliberately reduce the efficiency of its latest card by 50% when it is used to mine the crypto-currency Ethereum.",
			"coverImage": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/4BA7/production/_117076391_nvidia.jpg",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "Graphics card-maker Nvidia says it will deliberately reduce the efficiency of its latest card by 50% when it is used to mine the crypto-currency Ethereum. Crypto-currency enthusiasts have contributed to a shortage of graphics cards by snapping up supplies to use for non-gaming purposes Nvidia said it had intervened to make sure its products «end up in the hands of gamers» But it will also sell a bespoke crypto-currency mining processor."
		},
		{
			"id": 3,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "Tech Tent: Facebook v Australia - two sides to the story",
			"description": "The battle between the Australian government and the tech giants over a law which would make them for news content has been rumbling on for a while.",
			"coverImage": "https://ichef.bbci.co.uk/news/976/cpsprodpb/0CF6/production/_117081330_zuck-getty-1.jpg",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "The battle between the Australian government and the tech giants over a law which would make them pay for news content has been rumbling on for a while. But Facebook's move to ban all Australian news content from its platform has taken the conflict to a whole new level One of Rupert Murdoch's newspapers described «it as an act of war». But others see the actions of Australia's politicians as being an outrage against the principle of net neutrality This week's Tech Tent podcast asks whether Mark Zuckerberg overplayed his hand, making it more likely that other countries will follow Australia's lead."
		}
	],
	"articles": [
		{
			"id": 1,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "How to buy bitcoin?",
			"description": "Bitcoins can be bought for US dollars, euros or another fiat or cryptocurrency on a crypto exchange, directly from other individuals, or using a special ATM. It’s good to know that you can buy fractions of a bitcoin. So you don’t have to...",
			"coverImage": "https://www.newsbtc.com/wp-content/uploads/2021/02/ken-cheung-10py7Mvmf1g-unsplash.jpg",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "Bitcoin just rocketed to a new all-time high at $49,400 despite consolidation in the price of Ethereum. The leading cryptocurrency set this new high after spending most of the past week in the $47,00… [+2028 chars]"
		},
		{
			"id": 2,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "Can I Create My Own Cryptocurrency?",
			"description": ">Sure! You don’t even need to be a programmer to create your own cryptocurrency. Several existing blockchain platforms let you to make your own currency – as a community coin, a joke, or for any other reason. They make creating a...",
			"coverImage": "https://www.newsbtc.com/wp-content/uploads/2021/02/ken-cheung-10py7Mvmf1g-unsplash.jpg",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "Bitcoin just rocketed to a new all-time high at $49,400 despite consolidation in the price of Ethereum. The leading cryptocurrency set this new high after spending most of the past week in the $47,00… [+2028 chars]"
		},
		{
			"id": 3,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "How do cryptocurrencies differ?",
			"description": "The main differences relate to how coins are produced and spent. Some coins, like Bitcoin, Dash and Monero, are created in a process called “mining” which involves using powerful computers to solve complicated cryptographic puzzles. When...",
			"coverImage": "https://www.newsbtc.com/wp-content/uploads/2021/02/ken-cheung-10py7Mvmf1g-unsplash.jpg",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "Bitcoin just rocketed to a new all-time high at $49,400 despite consolidation in the price of Ethereum. The leading cryptocurrency set this new high after spending most of the past week in the $47,00… [+2028 chars]"
		},
		{
			"id": 4,
			"source": "newsBTC",
			"tags": [
				"business",
				"bitcoin"
			],
			"author": "Nick Chong",
			"title": "How do cryptocurrencies differ?",
			"description": "The main differences relate to how coins are produced and spent. Some coins, like Bitcoin, Dash and Monero, are created in a process called “mining” which involves using powerful computers to solve complicated cryptographic puzzles. When...",
			"coverImage": "https://www.newsbtc.com/wp-content/uploads/2021/02/ken-cheung-10py7Mvmf1g-unsplash.jpg",
			"publishedAt": "2021-02-14T07:58:16Z",
			"content": "Bitcoin just rocketed to a new all-time high at $49,400 despite consolidation in the price of Ethereum. The leading cryptocurrency set this new high after spending most of the past week in the $47,00… [+2028 chars]"
		}
	]
}